Revit 2024 API
ParameterTypeId.CouplerMainEndtreatment Property
 "End Treatment 1"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static ForgeTypeId CouplerMainEndtreatment { get; }
Visual Basic
Public Shared ReadOnly Property CouplerMainEndtreatment As ForgeTypeId
	Get
Visual C++
public:
static property ForgeTypeId^ CouplerMainEndtreatment {
	ForgeTypeId^ get ();
}
See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace